/*
Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).

Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.

Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез. Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот. Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.


For example:

| Input	 | Result    |
|--------|-----------|
| 2 3    | 15 5 1 5  |
| 5 7 8  |           |
| 1 2 3  |           |
| 1 1    |           |

 * */


#include <stdio.h>
#define MAX 100


int sumNum(int N1, int M1,int N2, int M2,int arr[MAX][MAX]){

    int s = 0;

    for (int i = N1; i <= N2; ++i) {
        for (int j = M1; j <= M2; ++j) {
            s += arr[i][j];
        }
    }

    return s;

}

int main() {

    int arr[MAX][MAX];
    int N,M,iN,iM;

    scanf("%d%d",&N,&M);

    for (int i = 0; i <N; ++i) {
        for (int j = 0; j < M; ++j) {
            scanf("%d",&arr[i][j]);
        }
    }
    scanf("%d%d",&iN,&iM);

    printf(
            "%d %d %d %d",
            sumNum(0,iM,iN-1,M,arr),
            sumNum(0,0,iN-1,iM-1,arr),
            sumNum(iN,0,N,iM-1,arr),
            sumNum(iN,iM,N,M,arr)
    );

    return 0;
}
