/*
Мартин фрлал паричка пет пати и за секое фрлање запишал 5 или 0 за соодветно добиено петка или глава при фрлањето.
 Вие ги гледате броевите запишани од Мартин и треба да  отпечатите 1 доколку има добиено барем три пати глава при фрлањето на паричката,
 а во спротивно 0.

For example:

| Input	    | Result |
|-----------|--------|
| 5 0 5 0 5 | 0      |
|-----------|--------|
| 0 5 0 5 0 | 1      |

 */
#include <stdio.h>

int main(){

    int c = 0;

    for(int i = 0; i<5; i++){
        int br;
        scanf("%d",&br);

        if(br == 0)
            c++;

    }

    printf(c>=3?"1":"0");
}