//Даден е правоаголник кој се наоѓа во првиот квадрант од координатниот систем и страните му се паралелни со оските.
// Правоаголникот се задава со координатите на долното лево и горното десно теме (темињата А и С) кои се цели броеви.
// Потоа, се внесуваат координатите на две точки. Вашата програма за секоја од двете точки на излез треба да отпечати DA,
// ако дадената точка лежи врз правоаголникот (во правоаголникот и на страните) и NE ако е надвор од него.

#include <stdio.h>

int main(){

    int n,i,j;
    scanf("%d",&n);
    int a[n];
    for(i=1;i<=n;i++)
    {
        scanf("%d",&a[i]);
    }
    for(i=1;i<=n;i++)
    {
        printf("%d ",a[i]);
    }
    printf("\n");
    for(i=n;i>=1;i--)
    {
        printf("%d ",a[i]);
    }
    printf("\n");
    for(i=n;i>=1;i-=2)
    {
        printf("%d ",a[i]);
    }
    printf("\n");

    int i2 = n%2 == 0? 2 : 1;

    for(i=i2;i<=n;i+=2)
    {
        printf("%d ",a[i]);
    }
    return 0;
}