/*
Да се напише програма која пресметува просечна оцена во семестар. Програмата чита 5 цели броја.
 Треба да се испечати еден реален број на две децимали, просек на прочитаните броеви.

For example:
-----------------------
Input      | Result
-----------|-----------
6 6 6 6 7  | 6.20
-----------------------
 */

#include <stdio.h>

int main(){

    int b1,b2,b3,b4,b5;
    float prosek;

    scanf("%d%d%d%d%d",&b1,&b2,&b3,&b4,&b5);

    prosek = (b1 + b2 + b3 + b4 + b5) / (float) 5;

    printf("%.2f",prosek);

    return 0;
}