/*
Пресметајте ја цената за електрична енергија која еден корисник треба да ја плати, во зависност од тоа колку kWh потрошил.
 За помалку 500 kWh се наплаќа 5 ден/kWh. Ако трошокот ја надмине оваа граница, тогаш за наредните 150 kWh
 се наплаќа 7.5 ден/kWh, за наредните 200 kWh се наплаќа 11 ден/kWh, а за секој трошок над тоа се доплаќа уште 13.5 ден/kWh.
 На крајот на сметката се додава 10% ДДВ доколку изнесува 7000 денари или помалку, додека ако изнесува повеќе од тоа, се додава 18% ДДВ.

For example:
------------------
Input |	Result
------|-----------
1000  | 9263.00
------------------
 */

#include <stdio.h>

int main(){

    int KWh;
    float cena = 0;
    float cenaSoDDV;

    scanf("%d",&KWh);

    cena = KWh < 500? KWh * 5 : 500 * 5;

    if(KWh - 150 > 350){
        cena = cena + (KWh < 650? ((500 - KWh)*(-1)) * 7.5 : 150 * 7.5);
    }

    if(KWh - 200 > 450){
        cena = cena + ( KWh < 850? ((650 - KWh)*(-1)) * 11 : 200 * 11);
    }

    if(KWh > 850){
        cena += ((850 - KWh)*(-1)) * 13.5;
    }

    int ddv;
    if(cena <= 7000)
        ddv = 10;
    else ddv = 18;

    cenaSoDDV = cena + ((cena * ddv) / 100);

    printf("%.2f",cenaSoDDV);

}