//Со Морзеовата азбука, знаците (букви, цифри) се претставуваат со точки и цртички. Цифрите од 0 до 4 се претставуваат,
// соодветно, на следниот начин: "-----", ".----", "..---", "...--", "....-". Од тастатура се внесува даден природен
// број N (N<100 000), и потоа се внесуваат N други природни броеви. За секој од внесените броеви, во посебен ред,
// да се отпечати остатокот при делењето на тој број со 5 во Морзеов код.

#include <stdio.h>


int main(){

    int n;

    scanf("%d",&n);

    for(int i = 0; i < n; i++){

        int b;

        scanf("%d",&b);

        switch(b % 5){
            case 0:
                printf("-----");
                break;
            case 1:
                printf(".----");
                break;
            case 2:
                printf("..---");
                break;
            case 3:
                printf("...--");
                break;
            case 4:
                printf("....-");
                break;


        }
        printf("\n");

    }


    return 0;
}