//Од стандарден влез се чита број n, а потоа се читаат и n броеви. Потребно е на екран да се испечатат сите броеви кои што
//се строго растечки односо секоја цифра е поголема од претходната (1589 е растечки, 1529 не е растечки). Проверката за
//тоа дали бројот е растечки да се реализира со посебна функција која ќе врати 1 ако е растечки и -1 ако не е растечки.
//Дополнително ако бројот е растечки за него треба да се повика функција која ќе ја пресмета сумата на цифрите од кои е составен.
//
//Дополнително: функцијата за пресметување на сума на цифри да биде рекурзивна
//
//Печатењето треба да е во следен формат: 1234 (suma:  10)

#include <stdio.h>

int sum(int num){
    return num == 0? 0 : sum(num / 10) + num % 10;
}
int check(int num){
    if(num == 0)
        return 1;
    return (num % 10) > (num % 100 /10)? check(num / 10) : -1;
}

int main(){
    int n;
    scanf("%d",&n);

    for(int i = 0; i < n; i++){
        int num;
        scanf("%d",&num);

        if(check(num) == -1){
            continue;
        }

        printf("%d (suma: %d)\n", num, sum(num));
    }

    return 0;
}
